const SCHEDULE = {
  pairs: [
    { number: 1, time: "08:20–09:40" },
    { number: 2, time: "09:50–11:10" },
    { number: 3, time: "11:30–12:50" },
    { number: 4, time: "13:00–14:20" },
    { number: 5, time: "14:40–16:00" },
    { number: 6, time: "16:10–17:30" },
    { number: 7, time: "17:40–19:00" },
  ],

  days: ["Понеділок", "Вівторок", "Середа", "Четвер", "Пʼятниця"],

  weeks: {
    1: {
      monday: [
        null,
        { type: "lab", subject: "Комп'ютерні мережі", teacher: "Д'яченко Лілія Іванівна", room: "8-312" },
        { type: "lecture", subject: "Інженерія клієнтських веб-систем", teacher: "Карачевцев Артем Олегович, Томюк Георгій Миколайович", room: "9-3" },
        { type: "lab", subject: "Інженерія вимог та управління IT-проектами", teacher: "Нікітін Юрій Алікович", room: "8-325" },
        null,
        null,
        null,
      ],
      tuesday: [
        null,
        null,
        { type: "lab", subject: "Архітектура та проєктування програмного забезпечення", teacher: "Дячук Ростислав Любомирович", room: "8-103" },
        { type: "lab", subject: "Якість програмного забезпечення та тестування", teacher: "Янушевський Сергій Володимирович", room: "8-213" },
        { type: "practice", subject: "Інженерія вимог та управління IT-проектами", teacher: "Нікітін Юрій Алікович", room: "8-207" },
        null,
        null,
      ],
      wednesday: [
        { type: "lecture", subject: "Архітектура та проєктування програмного забезпечення", teacher: "Дячук Ростислав Любомирович", room: "8-224" },
        { type: "lecture", subject: "Якість програмного забезпечення та тестування", teacher: "Нікітін Юрій Алікович", room: "8-224" },
        null,
        null,
        null,
          { type: "lab", subject: "Польська мова для професійного спілкування", teacher: "Слюсар Олег Федорович", room: "14-10" },
        { type: "lecture", subject: "Комп'ютерні мережі", teacher: "Д'яченко Лілія Іванівна", room: "онлайн" },
      ],
      thursday: [
        null,
        null,
        null,
        { type: "lecture", subject: "Маркетинг IT-продуктів", teacher: "Комісарчук Володимир Васильович, Дмитращук Кристина Миколаївна", room: "8-224" },
        { type: "lab", subject: "Маркетинг IT-продуктів", teacher: "Дмитращук Кристина Миколаївна", room: "8-101" },
        null,
          { type: "lecture", subject: "Технології Back-end розробки 18:00", teacher: "Валь Олександр Олександрович", room: "онлайн" },
      ],
      friday: [
        null,
        { type: "lab", subject: "Технології Back-end розробки", teacher: "Прохоров Георгій Валерійович", room: "8-207" },
        { type: "lab", subject: "Інженерія клієнтських веб-систем", teacher: "Когут Олег Васильович", room: "8-209" },
        null,
        null,
        { type: "lecture", subject: "Інженерія вимог та управління ІТ-проєктами", teacher: "Комісарчук Володимир Васильович", room: "онлайн" },
        null,
      ],
    },
  },
};
